app/controllers/skis_controller.rb

	def index
		@skis = Ski.all
---
SELECT "skis".* FROM "skis"

	def show
		ski_id = params[:id]

		@ski = Ski.find_by_id(ski_id)
---
SELECT  "skis".* FROM "skis" WHERE "skis"."id" = ? LIMIT 1  [["id", 3]]

	def update
		ski_id = params[:id]

		ski = Ski.find_by_id(ski_id)

		#whitelist params and save them to a variable
		ski_params = params.require(:ski).permit(:name, :description)

		#update the ski
		ski.update_attributes(ski_params)
---
SELECT  "skis".* FROM "skis" WHERE "skis"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "skis" SET "description" = ?, "updated_at" = ? WHERE "skis"."id" = ?  [["description", "Super fast and skinny skis for the 80's freak inside all of us. "], ["updated_at", "2016-01-04 00:35:32.372773"], ["id", 6]]

	def edit
		ski_id = params[:id]
		#get ski ID and save it
		@ski = Ski.find_by_id(ski_id)
---
SELECT  "skis".* FROM "skis" WHERE "skis"."id" = ? LIMIT 1  [["id", 2]]

	def destroy
		#get the ski id from the url params
		ski_id = params[:id]

		# use the id of the ski to find the ski in the database
		ski = Ski.find_by_id(ski_id)

		ski.destroy
---
SELECT  "skis".* FROM "skis" WHERE "skis"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "skis" WHERE "skis"."id" = ?  [["id", 5]]

	def create

		ski_params = params.require(:ski).permit(:name, :description)

		ski = Ski.new(ski_params)

		if ski.save
---
INSERT INTO "skis" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)